logan8866/STM32F429IGT6/UART/Project_1/User/bsp_uart.h
#include "stm32f4xx_it.h"

#define DEBUG_USART USART1
#define DEBUG_USART_CLK RCC_APB2Periph_USART1
#define DEBUG_USART_BAUDRATE 115200 //´®¿Ú²¨ÌØÂÊ

#define DEBUG_USART_RX_GPIO_PORT GPIOA
#define DEBUG_USART_RX_GPIO_CLK RCC_AHB1Periph_GPIOA
#define DEBUG_USART_RX_PIN GPIO_Pin_10
#define DEBUG_USART_RX_AF GPIO_AF_USART1
#define DEBUG_USART_RX_SOURCE GPIO_PinSource10
 
 #define DEBUG_USART_TX_GPIO_PORT GPIOA
 #define DEBUG_USART_TX_GPIO_CLK RCC_AHB1Periph_GPIOA
 #define DEBUG_USART_TX_PIN GPIO_Pin_9
 #define DEBUG_USART_TX_AF GPIO_AF_USART1
 #define DEBUG_USART_TX_SOURCE GPIO_PinSource9
 
 #define DEBUG_USART_IRQHandler USART1_IRQHandler
 #define DEBUG_USART_IRQ USART1_IRQn
 
static void NVIC_Configuration(void);
void Debug_USART_Config(void);
void Usart_SendByte( USART_TypeDef * pUSARTx, uint8_t ch);
void Usart_SendString( USART_TypeDef * pUSARTx, char *str);
void DEBUG_USART_IRQHandler(void);